In [1]:
# 1. Creating the dataframe using 'dictionary'

In [10]:
# pandas 
import pandas as pd

In [11]:
# 1. creating the dataframe
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Tom','eshan','aman','ram'],
    'Age': [28, 24, 35, 32, 40,33,44,55],
    'City': ['New York', 'Paris', 'Berlin', 'London', 'Tokyo','city1','city2','city3']
}

df = pd.DataFrame(data)

In [12]:
# 2. Some basic operations
df.head()

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London
4    Tom   40     Tokyo

In [13]:
df.tail()

    Name  Age    City
3  Linda   32  London
4    Tom   40   Tokyo
5  eshan   33   city1
6   aman   44   city2
7    ram   55   city3

In [14]:
# all necessary info about Null values, Data Type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   City    8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [15]:
# info of numetrrical columns
df.describe()

             Age
count   8.000000
mean   36.375000
std     9.811618
min    24.000000
25%    31.000000
50%    34.000000
75%    41.000000
max    55.000000

In [16]:
# 'loc' for row_idx and column_name
print(df.loc[0,"Age"])

28

In [17]:
# 'iloc' for row_idx and column_idx --> also can enter range using slicing like below in both 'loc' and 'iloc'
print(df.iloc[0:2,0:2])

   Name  Age
0  John   28
1  Anna   24

In [18]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Tom', 'John', 'Anna', 'Peter'],
    'City': ['New York', 'Paris', 'Berlin', 'London', 'Tokyo', 'New York', 'Paris', 'Berlin'],
    'Sales': [100, 200, 300, 400, 500, 100, 200, 300]
}
df = pd.DataFrame(data)

In [19]:
# 3. group-by ops --> grouping with which attribute and use one aggregator
df.groupby('Name').sum()

                   City  Sales
Name
Anna         ParisParis    400
John   New YorkNew York    200
Linda            London    400
Peter      BerlinBerlin    600
Tom               Tokyo    500

In [20]:
# also can extract particular columns if want to
df.groupby('Name')["Sales"].sum()

Name
Anna     400
John     200
Linda    400
Peter    600
Tom      500
Name: Sales, dtype: int64

In [21]:
# 4. also can create the pivot_tables --> 
df.pivot_table(index='Name',columns = 'City',values='Sales',aggfunc='sum')

City   Berlin  London  New York  Paris  Tokyo
Name
Anna      NaN     NaN       NaN  400.0    NaN
John      NaN     NaN     200.0    NaN    NaN
Linda     NaN   400.0       NaN    NaN    NaN
Peter   600.0     NaN       NaN    NaN    NaN
Tom       NaN     NaN       NaN    NaN  500.0

In [22]:
# 5. Joins and merge
# Create sample DataFrames
data1 = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 24, 35, 32]
}
df1 = pd.DataFrame(data1)

data2 = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'City': ['New York', 'Paris', 'Berlin', 'London']
}
df2 = pd.DataFrame(data2)

In [23]:
# Join operation
print(df1.set_index('Name').join(df2.set_index('Name'))) # --> using 'join' seems difficult
newdf = pd.merge(df1,df2,on="Name") # --> using merge it is easy
newdf

       Age      City
Name
John    28  New York
Anna    24     Paris
Peter   35    Berlin
Linda   32    London

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [25]:
# 6. for dropping NA --> df.dropna()
# 7. for dropping duplicates -> df.drop_duplicates()

In [26]:
# 8. Sorting with respect to age
newdf.sort_values("Age")

    Name  Age      City
1   Anna   24     Paris
0   John   28  New York
3  Linda   32    London
2  Peter   35    Berlin

In [46]:
# # 9. Group by status and calculate count and average temperature 
# Define the SensorHealthReport data
# if want column with personalize name and agg type use following way
sensor_data = [
    {"sensor_id": "TEMP_01", "timestamp": 10.5, "status": "OK", "temperature": 45.2},
    {"sensor_id": "BRAKE_02", "timestamp": 20.1, "status": "WARN", "temperature": 60.3},
    {"sensor_id": "TEMP_01", "timestamp": 30.7, "status": "FAIL", "temperature": 75.0},
    {"sensor_id": "BRAKE_02", "timestamp": 40.2, "status": "OK", "temperature": 50.1},
    {"sensor_id": "TEMP_01", "timestamp": 50.9, "status": "WARN", "temperature": 65.4}
]
# Convert to DataFrame
df = pd.DataFrame(sensor_data)
df.groupby("status").agg(
    count = ("status", "size"),
    average_temperature=("temperature", "mean")
)

        count  average_temperature
status
FAIL        1                75.00
OK          2                47.65
WARN        2                62.85